from modules.database.Mysql4 import Mysql4

import pandas as pd

from tqdm import tqdm
import pprint


if __name__ == '__main__':
    mysql = Mysql4(host='172.31.19.191', db_name='orix_data', user='root')
    # =======================================================
    # Q.1 multiprocessingなどを用いて並列化を実装せよ．
    # また，通常時と比べてその速さを実感せよ
    



    # =======================================================
    # Q.2 引数を複数取れる並列化プログラムを作成せよ
    


    # =======================================================
    # Q.3 全被験者のハザード走行時における前後5秒間の平均速度，
    # 標準偏差，最大，最小の統計量を算出するプログラムを作成せよ．
    # ハザードの種類は急減速走行とする
    
    

    